import { createContext, useState } from "react";
import image from '../Images/photo1.jpg'
import image1 from '../Images/photo2.jpg'
import video from '../Images/video.mp4'
// import file from "../Images/"

// إنشاء السياق
export const NewsContext = createContext();

// المزوّد الرئيسي
export const NewsProvider = ({ children }) => {
  const [newsList, setNewsList] = useState([
    {
      title: "افتتاح مركز تدريب مهني",
      category: "برامج الجمعية",
      media: null,
      file: null,
      content:
        "تم افتتاح مركز تدريب مهني جديد بهدف تمكين الشباب في قطاع غزة، وتوفير فرص عمل تقنية.",
    },
     {
      title: "تاهيل النصيرات تُطلق مبادرة أيام فرح بمناسبة عيد الأضحى ",
      category: "برامج الجمعية",
      media: null,
      file: null,
      content:
        `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
    },
     {
      title: "تاهيل النصيرات تُطلق مبادرة أيام فرح بمناسبة عيد الأضحى ",
      category: "برامج الجمعية",
      media: null,
      file: null,
      content:
        `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
    },
     {
      title: "تاهيل النصيرات تُطلق مبادرة أيام فرح بمناسبة عيد الأضحى ",
      category: "دراسات و مقالات",
      media: null,
      file: null,
      content:
        `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
    },
    {
      title: "مبادرة نظف شارعك",
      category: "مدرسة بيسان الخاصة",
      media: null,
      file: null,
      content:
        "طلاب المدرسة أطلقوا حملة تطوعية لتنظيف الشوارع وتعزيز الوعي البيئي.",
    },
     {
      title: "تاهيل النصيرات تُطلق مبادرة أيام فرح بمناسبة عيد الأضحى ",
      category: "دراسات و مقالات",
      media: null,
      file: null,
      content:
        `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
    },
     {
      title: "تاهيل النصيرات تُطلق مبادرة أيام فرح بمناسبة عيد الأضحى ",
      category: "برامج الجمعية",
      media: null,
      file: null,
      content:
        `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
    },
    
     {
      title: "نعم للتعلم",
      category: "شهادات",
      media: null,
      file: null,
      content:
       `مشروع تحسين الممارسات الصحية والبيئية وحالة الصرف الصحي لأسر ذوي الإعاقة في المحافظة الوسطى يعلن عن مجموعة من الدورات التدريبية لمواطنين مستفيدين مشروع المال مقابل العمل من باب بناء القدرات والمهارات الذاتية وتنمية المعارف، والاستغلال الأمثل لأوقات الفراغ `
       },
     {
      title: "نعم للتعلم",
      category: "شهادات",
      media: null,
      file: null,
      content:
       `مشروع تحسين الممارسات الصحية والبيئية وحالة الصرف الصحي لأسر ذوي الإعاقة في المحافظة الوسطى يعلن عن مجموعة من الدورات التدريبية لمواطنين مستفيدين مشروع المال مقابل العمل من باب بناء القدرات والمهارات الذاتية وتنمية المعارف، والاستغلال الأمثل لأوقات الفراغ `,
    },
     {
      title: "",
      category: "صور",
      media: { image: image },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
     {
      title: "نعم للتعلم",
      category: "شهادات",
      media: null,
      file: null,
      content:
       `مشروع تحسين الممارسات الصحية والبيئية وحالة الصرف الصحي لأسر ذوي الإعاقة في المحافظة الوسطى يعلن عن مجموعة من الدورات التدريبية لمواطنين مستفيدين مشروع المال مقابل العمل من باب بناء القدرات والمهارات الذاتية وتنمية المعارف، والاستغلال الأمثل لأوقات الفراغ `,
    }
    ,
     {
      title: "",
      category: "صور",
      media: { image: image },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
     {
      title: "",
      category: "صور",
      media: { image: image1 },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
     {
      title: "",
      category: "صور",
      media: { image: image },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
     {
      title: "",
      category: "صور",
      media: { image: image },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
     {
      title: "",
      category: "صور",
      media: { image: image },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
     {
      title: "",
      category: "صور",
      media: { image: image1 },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    
     {
      title: "",
      category: "صور",
      media: { image: image1 },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
      title: "",
      category: "صور",
      media: { image: image1 },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
      title: "",
      category: "صور",
      media: { image: image1 },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
      title: "",
      category: "صور",
      media: { image: image1 },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
      title: "",
      category: "صور",
      media: { image: image1 },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
      title: "",
      category: "فيديو",
      media: { video: video },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
      title: "",
      category: "فيديو",
      media: { video: video },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
      title: "",
      category: "صور",
      media: { video: video },
      // URL.createObjectURL(news.media)

      file: null,
      content:
     ``,
    },
    {
    title: "ملف تدريبي جديد",
    category: "ملفات",
    media: null,
    file: "/files/Mokeup.pdf", 
    content: "ملف PDF مرفق يحتوي على تدريبات حديثة."
  },
  
    {
    title: "ملف تدريبي جديد",
    category: "ملفات",
    media: null,
    file: "/files/Mokeup.pdf", 
    content: "ملف PDF مرفق يحتوي على تدريبات حديثة."
  },
  ]);

  // دالة إضافة خبر
  const addNews = (news) => {
    setNewsList((prev) => [...prev, news]);
  };

  // دالة حذف خبر
  const deleteNews = (index) => {
    setNewsList((prev) => prev.filter((_, i) => i !== index));
  };

  // دالة تعديل خبر
  const editNews = (index, updatedNews) => {
    setNewsList((prev) => {
      const copy = [...prev];
      copy[index] = updatedNews;
      return copy;
    });
  };

  return (
    <NewsContext.Provider
      value={{
        newsList,
        addNews,
        deleteNews,
        editNews,
      }}
    >
      {children}
    </NewsContext.Provider>
  );
};
