// src/pages/AlbumDetail.jsx
import { useParams } from "react-router-dom";
import photo1 from "../Images/photo1.jpg";
import SideBar from "../SideBar";
import video1 from "../Images/video.mp4"; 

 
const fakeData = [
  {
       id: "1",
       video: video1,
       title: "《فيديو: مبادرة أيام الفرح في عيد الأضحى المبارك》",
       date: "25 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id: "2",
       video: video1,
       title: "《فيديو: جلسات توعية مجتمعية للأطفال》",
       date: "24 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id: "3",
       video: video1,
       title: "《تغطية إعلامية للأنشطة الصيفية》",
       date: "23 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id: "4",
       video: video1,
       title: "《تغطية إعلامية للأنشطة الصيفية》",
       date: "23 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id: "5",
       video: video1,
       title: "《تغطية إعلامية للأنشطة الصيفية》",
       date: "23 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id: "6",
       video: video1,
       title: "《تغطية إعلامية للأنشطة الصيفية》",
       date: "23 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id: "7",
       video: video1,
       title: "《تغطية إعلامية للأنشطة الصيفية》",
       date: "23 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id: "8",
       video: video1,
       title: "《تغطية إعلامية للأنشطة الصيفية》",
       date: "23 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
     {
       id:"9" ,
       video: video1,
       title: "《تغطية إعلامية للأنشطة الصيفية》",
       date: "23 يونيو 2025",
       content: `أطلقت جمعية التأهيل والتدريب الاجتماعي - النصيرات، صباح اليوم السبت 7 يونيو، ثاني أيام عيد الأضحى المبارك، مبادرة ترفيه وتنشيط للأطفال والتي جاءت تحت عنوان "أيام فرح" بمتابعة وتنسيق قسم الدعم النفسي الاجتماعي، وقد انطلق النشاط من منطقة مخيم 5 شمال النصيرات، أمام بيت الطفل الشهيد/ محمد شحادة، الذي اهديه هذا النشاط لروحه، وروح أطفال شهداء المخيم.
وقد شمل الفعالية مجموعة من الأنشطة الترفيهية المتنوعة والمتميزة، التي ساهمت بشكل كبير في رسم الابتسامة على وجوه الأطفال في أيام العيد، رغم الظروف الصعبة التي يعيشها الاطفال في واقع الحرب المدمرة في قطاع غزة.
بدوره أعرب سكان المخيم( مخيم 5) عن سعادتهم الكبيرة لهذا النشاط الذي حقق جزء مهم وكبير لترفيه الاطفال وتنشيطهم ورسم الابتسامة على وجوههم، والتي اعتبروها ايضا رسالة تحدي للواقع وتبديل الألم بالأمل والنور، والدعوة للحياة على الموت، كون أطفالنا يرفضون الموت ويبحثون عن مستقبل آمن مطمئن عزيز كريم لهم.
من جانب أكدت جمعية التأهيل عن استكمال هذه المبادرة لتستهدف مناطق جغرافية متعددة، ليكونو الفرح شامل ويصل إلى أطفالنا ما استطعنا إلى ذلك سبيلا.`,
     },
];



const VideoDetail = () => {
  const { id } = useParams();
  const album = fakeData.find((item) => item.id === id);
  

  if (!album) {
    return <div className="text-center mt-10 text-red-600">لا يوجد ألبوم مطابق</div>;
  }

  return (
    <section className="w-full flex flex-col md:flex-row gap-6 py-8 container mx-auto">
    <div className="max-w-2xl  p-6">
      <h1 className="text-2xl font-bold text-gray-800 mb-4">{album.title}</h1>
      <video
        src={album.video}
        controls
        className="w-full h-96 object-cover  rounded-lg mb-6"
      />
      <p className="text-sm text-gray-500 mb-1">{album.date}</p>
      <p className="text-gray-700 leading-relaxed whitespace-pre-line">{album.content}</p>
    </div>
    <SideBar/>
    </section>

    
  );
};

export default VideoDetail;
